docs/performance/raw/20260926-a058-329/t12p20-browse200/k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/webhook-under-browse.js
        output: -

     scenarios: (100.00%) 3 scenarios, 3900 max VUs, 1m15s max duration (incl. graceful stop):
              * browse: 200.00 iterations/s for 45s (maxVUs: 300-3000, exec: browseOnce, gracefulStop: 30s)
              * hook: 10.00 iterations/s for 45s (maxVUs: 40-300, exec: webhookOnce, gracefulStop: 30s)
              * pay: 50.00 iterations/s for 45s (maxVUs: 200-600, exec: payOnce, gracefulStop: 30s)


running (0m00.9s), 0059/0540 VUs, 179 complete and 0 interrupted iterations
browse   [   2% ] 0012/0300 VUs  00.9s/45s  200.00 iters/s
hook     [   2% ] 001/040 VUs    00.9s/45s  10.00 iters/s
pay      [   2% ] 046/200 VUs    00.9s/45s  50.00 iters/s

running (0m01.9s), 0064/0540 VUs, 435 complete and 0 interrupted iterations
browse   [   4% ] 0011/0300 VUs  01.9s/45s  200.00 iters/s
hook     [   4% ] 001/040 VUs    01.9s/45s  10.00 iters/s
pay      [   4% ] 052/200 VUs    01.9s/45s  50.00 iters/s

running (0m02.9s), 0063/0540 VUs, 697 complete and 0 interrupted iterations
browse   [   6% ] 0013/0300 VUs  02.9s/45s  200.00 iters/s
hook     [   6% ] 001/040 VUs    02.9s/45s  10.00 iters/s
pay      [   6% ] 049/200 VUs    02.9s/45s  50.00 iters/s

running (0m03.9s), 0056/0540 VUs, 963 complete and 0 interrupted iterations
browse   [   9% ] 0008/0300 VUs  03.9s/45s  200.00 iters/s
hook     [   9% ] 001/040 VUs    03.9s/45s  10.00 iters/s
pay      [   9% ] 047/200 VUs    03.9s/45s  50.00 iters/s

running (0m05.0s), 0077/0540 VUs, 1203 complete and 0 interrupted iterations
browse   [  11% ] 0015/0300 VUs  04.9s/45s  200.00 iters/s
hook     [  11% ] 001/040 VUs    04.9s/45s  10.00 iters/s
pay      [  11% ] 061/200 VUs    04.9s/45s  50.00 iters/s

running (0m05.9s), 0096/0540 VUs, 1443 complete and 0 interrupted iterations
browse   [  13% ] 0012/0300 VUs  05.9s/45s  200.00 iters/s
hook     [  13% ] 002/040 VUs    05.9s/45s  10.00 iters/s
pay      [  13% ] 082/200 VUs    05.9s/45s  50.00 iters/s

running (0m06.9s), 0069/0540 VUs, 1730 complete and 0 interrupted iterations
browse   [  15% ] 0012/0300 VUs  06.9s/45s  200.00 iters/s
hook     [  15% ] 001/040 VUs    06.9s/45s  10.00 iters/s
pay      [  15% ] 056/200 VUs    06.9s/45s  50.00 iters/s

running (0m07.9s), 0067/0540 VUs, 1992 complete and 0 interrupted iterations
browse   [  18% ] 0013/0300 VUs  07.9s/45s  200.00 iters/s
hook     [  18% ] 001/040 VUs    07.9s/45s  10.00 iters/s
pay      [  18% ] 053/200 VUs    07.9s/45s  50.00 iters/s

running (0m08.9s), 0066/0540 VUs, 2253 complete and 0 interrupted iterations
browse   [  20% ] 0012/0300 VUs  08.9s/45s  200.00 iters/s
hook     [  20% ] 001/040 VUs    08.9s/45s  10.00 iters/s
pay      [  20% ] 053/200 VUs    08.9s/45s  50.00 iters/s

running (0m09.9s), 0060/0540 VUs, 2518 complete and 0 interrupted iterations
browse   [  22% ] 0011/0300 VUs  09.9s/45s  200.00 iters/s
hook     [  22% ] 001/040 VUs    09.9s/45s  10.00 iters/s
pay      [  22% ] 048/200 VUs    09.9s/45s  50.00 iters/s

running (0m10.9s), 0062/0540 VUs, 2777 complete and 0 interrupted iterations
browse   [  24% ] 0011/0300 VUs  10.9s/45s  200.00 iters/s
hook     [  24% ] 001/040 VUs    10.9s/45s  10.00 iters/s
pay      [  24% ] 050/200 VUs    10.9s/45s  50.00 iters/s

running (0m11.9s), 0061/0540 VUs, 3036 complete and 0 interrupted iterations
browse   [  26% ] 0010/0300 VUs  11.9s/45s  200.00 iters/s
hook     [  26% ] 001/040 VUs    11.9s/45s  10.00 iters/s
pay      [  26% ] 050/200 VUs    11.9s/45s  50.00 iters/s

running (0m12.9s), 0064/0540 VUs, 3295 complete and 0 interrupted iterations
browse   [  29% ] 0013/0300 VUs  12.9s/45s  200.00 iters/s
hook     [  29% ] 001/040 VUs    12.9s/45s  10.00 iters/s
pay      [  29% ] 050/200 VUs    12.9s/45s  50.00 iters/s

running (0m13.9s), 0064/0540 VUs, 3555 complete and 0 interrupted iterations
browse   [  31% ] 0013/0300 VUs  13.9s/45s  200.00 iters/s
hook     [  31% ] 001/040 VUs    13.9s/45s  10.00 iters/s
pay      [  31% ] 050/200 VUs    13.9s/45s  50.00 iters/s

running (0m14.9s), 0061/0540 VUs, 3817 complete and 0 interrupted iterations
browse   [  33% ] 0011/0300 VUs  14.9s/45s  200.00 iters/s
hook     [  33% ] 001/040 VUs    14.9s/45s  10.00 iters/s
pay      [  33% ] 049/200 VUs    14.9s/45s  50.00 iters/s

running (0m15.9s), 0064/0540 VUs, 4075 complete and 0 interrupted iterations
browse   [  35% ] 0010/0300 VUs  15.9s/45s  200.00 iters/s
hook     [  35% ] 002/040 VUs    15.9s/45s  10.00 iters/s
pay      [  35% ] 052/200 VUs    15.9s/45s  50.00 iters/s

running (0m16.9s), 0058/0540 VUs, 4341 complete and 0 interrupted iterations
browse   [  38% ] 0010/0300 VUs  16.9s/45s  200.00 iters/s
hook     [  38% ] 001/040 VUs    16.9s/45s  10.00 iters/s
pay      [  38% ] 047/200 VUs    16.9s/45s  50.00 iters/s

running (0m17.9s), 0057/0540 VUs, 4602 complete and 0 interrupted iterations
browse   [  40% ] 0011/0300 VUs  17.9s/45s  200.00 iters/s
hook     [  40% ] 001/040 VUs    17.9s/45s  10.00 iters/s
pay      [  40% ] 045/200 VUs    17.9s/45s  50.00 iters/s

running (0m18.9s), 0056/0540 VUs, 4862 complete and 0 interrupted iterations
browse   [  42% ] 0010/0300 VUs  18.9s/45s  200.00 iters/s
hook     [  42% ] 001/040 VUs    18.9s/45s  10.00 iters/s
pay      [  42% ] 045/200 VUs    18.9s/45s  50.00 iters/s

running (0m19.9s), 0059/0540 VUs, 5120 complete and 0 interrupted iterations
browse   [  44% ] 0011/0300 VUs  19.9s/45s  200.00 iters/s
hook     [  44% ] 001/040 VUs    19.9s/45s  10.00 iters/s
pay      [  44% ] 047/200 VUs    19.9s/45s  50.00 iters/s

running (0m20.9s), 0064/0540 VUs, 5375 complete and 0 interrupted iterations
browse   [  46% ] 0011/0300 VUs  20.9s/45s  200.00 iters/s
hook     [  46% ] 001/040 VUs    20.9s/45s  10.00 iters/s
pay      [  46% ] 052/200 VUs    20.9s/45s  50.00 iters/s

running (0m21.9s), 0062/0540 VUs, 5637 complete and 0 interrupted iterations
browse   [  49% ] 0012/0300 VUs  21.9s/45s  200.00 iters/s
hook     [  49% ] 001/040 VUs    21.9s/45s  10.00 iters/s
pay      [  49% ] 049/200 VUs    21.9s/45s  50.00 iters/s

running (0m22.9s), 0055/0540 VUs, 5904 complete and 0 interrupted iterations
browse   [  51% ] 0008/0300 VUs  22.9s/45s  200.00 iters/s
hook     [  51% ] 001/040 VUs    22.9s/45s  10.00 iters/s
pay      [  51% ] 046/200 VUs    22.9s/45s  50.00 iters/s

running (0m23.9s), 0060/0540 VUs, 6159 complete and 0 interrupted iterations
browse   [  53% ] 0012/0300 VUs  23.9s/45s  200.00 iters/s
hook     [  53% ] 001/040 VUs    23.9s/45s  10.00 iters/s
pay      [  53% ] 047/200 VUs    23.9s/45s  50.00 iters/s

running (0m24.9s), 0060/0540 VUs, 6418 complete and 0 interrupted iterations
browse   [  55% ] 0012/0300 VUs  24.9s/45s  200.00 iters/s
hook     [  55% ] 001/040 VUs    24.9s/45s  10.00 iters/s
pay      [  55% ] 047/200 VUs    24.9s/45s  50.00 iters/s

running (0m25.9s), 0069/0540 VUs, 6670 complete and 0 interrupted iterations
browse   [  58% ] 0012/0300 VUs  25.9s/45s  200.00 iters/s
hook     [  58% ] 001/040 VUs    25.9s/45s  10.00 iters/s
pay      [  58% ] 056/200 VUs    25.9s/45s  50.00 iters/s

running (0m26.9s), 0057/0540 VUs, 6942 complete and 0 interrupted iterations
browse   [  60% ] 0009/0300 VUs  26.9s/45s  200.00 iters/s
hook     [  60% ] 001/040 VUs    26.9s/45s  10.00 iters/s
pay      [  60% ] 047/200 VUs    26.9s/45s  50.00 iters/s

running (0m27.9s), 0060/0540 VUs, 7199 complete and 0 interrupted iterations
browse   [  62% ] 0012/0300 VUs  27.9s/45s  200.00 iters/s
hook     [  62% ] 001/040 VUs    27.9s/45s  10.00 iters/s
pay      [  62% ] 047/200 VUs    27.9s/45s  50.00 iters/s

running (0m28.9s), 0047/0540 VUs, 7472 complete and 0 interrupted iterations
browse   [  64% ] 0005/0300 VUs  28.9s/45s  200.00 iters/s
hook     [  64% ] 000/040 VUs    28.9s/45s  10.00 iters/s
pay      [  64% ] 042/200 VUs    28.9s/45s  50.00 iters/s

running (0m29.9s), 0061/0540 VUs, 7717 complete and 0 interrupted iterations
browse   [  66% ] 0011/0300 VUs  29.9s/45s  200.00 iters/s
hook     [  66% ] 001/040 VUs    29.9s/45s  10.00 iters/s
pay      [  66% ] 049/200 VUs    29.9s/45s  50.00 iters/s

running (0m30.9s), 0068/0540 VUs, 7970 complete and 0 interrupted iterations
browse   [  69% ] 0012/0300 VUs  30.9s/45s  200.00 iters/s
hook     [  69% ] 002/040 VUs    30.9s/45s  10.00 iters/s
pay      [  69% ] 054/200 VUs    30.9s/45s  50.00 iters/s

running (0m31.9s), 0060/0540 VUs, 8239 complete and 0 interrupted iterations
browse   [  71% ] 0010/0300 VUs  31.9s/45s  200.00 iters/s
hook     [  71% ] 001/040 VUs    31.9s/45s  10.00 iters/s
pay      [  71% ] 049/200 VUs    31.9s/45s  50.00 iters/s

running (0m32.9s), 0064/0540 VUs, 8495 complete and 0 interrupted iterations
browse   [  73% ] 0012/0300 VUs  32.9s/45s  200.00 iters/s
hook     [  73% ] 001/040 VUs    32.9s/45s  10.00 iters/s
pay      [  73% ] 051/200 VUs    32.9s/45s  50.00 iters/s

running (0m33.9s), 0061/0540 VUs, 8758 complete and 0 interrupted iterations
browse   [  75% ] 0014/0300 VUs  33.9s/45s  200.00 iters/s
hook     [  75% ] 001/040 VUs    33.9s/45s  10.00 iters/s
pay      [  75% ] 046/200 VUs    33.9s/45s  50.00 iters/s

running (0m34.9s), 0057/0540 VUs, 9021 complete and 0 interrupted iterations
browse   [  78% ] 0011/0300 VUs  34.9s/45s  200.00 iters/s
hook     [  78% ] 001/040 VUs    34.9s/45s  10.00 iters/s
pay      [  78% ] 045/200 VUs    34.9s/45s  50.00 iters/s

running (0m35.9s), 0058/0540 VUs, 9280 complete and 0 interrupted iterations
browse   [  80% ] 0011/0300 VUs  35.9s/45s  200.00 iters/s
hook     [  80% ] 001/040 VUs    35.9s/45s  10.00 iters/s
pay      [  80% ] 046/200 VUs    35.9s/45s  50.00 iters/s

running (0m36.9s), 0064/0540 VUs, 9534 complete and 0 interrupted iterations
browse   [  82% ] 0012/0300 VUs  36.9s/45s  200.00 iters/s
hook     [  82% ] 001/040 VUs    36.9s/45s  10.00 iters/s
pay      [  82% ] 051/200 VUs    36.9s/45s  50.00 iters/s

running (0m37.9s), 0062/0540 VUs, 9797 complete and 0 interrupted iterations
browse   [  84% ] 0013/0300 VUs  37.9s/45s  200.00 iters/s
hook     [  84% ] 001/040 VUs    37.9s/45s  10.00 iters/s
pay      [  84% ] 048/200 VUs    37.9s/45s  50.00 iters/s

running (0m38.9s), 0053/0540 VUs, 10066 complete and 0 interrupted iterations
browse   [  86% ] 0009/0300 VUs  38.9s/45s  200.00 iters/s
hook     [  86% ] 001/040 VUs    38.9s/45s  10.00 iters/s
pay      [  86% ] 043/200 VUs    38.9s/45s  50.00 iters/s

running (0m39.9s), 0054/0540 VUs, 10324 complete and 0 interrupted iterations
browse   [  89% ] 0008/0300 VUs  39.9s/45s  200.00 iters/s
hook     [  89% ] 001/040 VUs    39.9s/45s  10.00 iters/s
pay      [  89% ] 045/200 VUs    39.9s/45s  50.00 iters/s

running (0m40.9s), 0058/0540 VUs, 10580 complete and 0 interrupted iterations
browse   [  91% ] 0011/0300 VUs  40.9s/45s  200.00 iters/s
hook     [  91% ] 001/040 VUs    40.9s/45s  10.00 iters/s
pay      [  91% ] 046/200 VUs    40.9s/45s  50.00 iters/s

running (0m41.9s), 0060/0540 VUs, 10839 complete and 0 interrupted iterations
browse   [  93% ] 0011/0300 VUs  41.9s/45s  200.00 iters/s
hook     [  93% ] 001/040 VUs    41.9s/45s  10.00 iters/s
pay      [  93% ] 048/200 VUs    41.9s/45s  50.00 iters/s

running (0m42.9s), 0058/0540 VUs, 11101 complete and 0 interrupted iterations
browse   [  95% ] 0013/0300 VUs  42.9s/45s  200.00 iters/s
hook     [  95% ] 001/040 VUs    42.9s/45s  10.00 iters/s
pay      [  95% ] 044/200 VUs    42.9s/45s  50.00 iters/s

running (0m43.9s), 0062/0540 VUs, 11357 complete and 0 interrupted iterations
browse   [  98% ] 0013/0300 VUs  43.9s/45s  200.00 iters/s
hook     [  98% ] 001/040 VUs    43.9s/45s  10.00 iters/s
pay      [  98% ] 048/200 VUs    43.9s/45s  50.00 iters/s

running (0m44.9s), 0056/0540 VUs, 11623 complete and 0 interrupted iterations
browse   [ 100% ] 0010/0300 VUs  44.9s/45s  200.00 iters/s
hook     [ 100% ] 001/040 VUs    44.9s/45s  10.00 iters/s
pay      [ 100% ] 045/200 VUs    44.9s/45s  50.00 iters/s

running (0m45.9s), 0025/0540 VUs, 11678 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ↓ [ 100% ] 044/200 VUs    45s  50.00 iters/s


  █ THRESHOLDS 

    http_req_duration{name:confirm}
    ✓ 'p(95)<600000' p(95)=5.28s

    http_req_duration{name:webhook}
    ✓ 'p(95)<600000' p(95)=100.9ms


  █ TOTAL RESULTS 

    checks_total.......: 1       0.021446/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ login 200

    CUSTOM
    browse_2xx.....................: 6044   129.620344/s
    browse_503.....................: 2957   63.416174/s
    browse_ms......................: avg=54.31ms  med=30.81ms  max=546.06ms p(90)=186.46ms p(95)=231.16ms p(99)=286.95ms
    webhook_ms.....................: avg=38.12ms  med=27.97ms  max=253.41ms p(90)=72.36ms  p(95)=100.9ms  p(99)=156.66ms
    webhook_over_10s...............: 0.00%  0 out of 451

    HTTP
    http_req_duration..............: avg=196.89ms med=37.51ms  max=6.23s    p(90)=199.91ms p(95)=256.93ms p(99)=5.25s   
      { expected_response:true }...: avg=272.85ms med=41.94ms  max=6.23s    p(90)=222.94ms p(95)=285.69ms p(99)=5.3s    
      { name:confirm }.............: avg=954.69ms med=131.53ms max=6.23s    p(90)=5.18s    p(95)=5.28s    p(99)=5.51s   
      { name:webhook }.............: avg=38.12ms  med=27.97ms  max=253.41ms p(90)=72.36ms  p(95)=100.9ms  p(99)=156.66ms
    http_req_failed................: 34.74% 4848 out of 13955
    http_reqs......................: 13955  299.280592/s

    EXECUTION
    iteration_duration.............: avg=235.21ms med=40.81ms  max=6.38s    p(90)=229.75ms p(95)=292.5ms  p(99)=5.33s   
    iterations.....................: 11703  250.983932/s
    vus............................: 25     min=25            max=95 
    vus_max........................: 540    min=540           max=540

    NETWORK
    data_received..................: 30 MB  650 kB/s
    data_sent......................: 3.5 MB 75 kB/s



running (0m46.6s), 0000/0540 VUs, 11703 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ✓ [ 100% ] 000/200 VUs    45s  50.00 iters/s